In [20]:
import pandas as pd

In [22]:
s =pd.DataFrame([1,2,3,4])
s

   0
0  1
1  2
2  3
3  4

In [25]:
t = pd.DataFrame([1,2,3,4], index = ['i','ii','iii','iv'])
t

     0
i    1
ii   2
iii  3
iv   4

In [28]:
data = {
    'name' : ['a','b','c','d'] ,
    'age' : [12,12,14,15] ,
    'gender' : ['m ', 'm' , 'f' ,'o']
}
a = pd.DataFrame(data)
a

  name  age gender
0    a   12     m
1    b   12      m
2    c   14      f
3    d   15      o

In [29]:
b = pd.read_excel("Data.xlsx")
b

      Name   Age Department  Salary
0    Alice  25.0         HR   50000
1      Bob  30.0         IT   60000
2  Charlie   NaN    Finance   70000
3    David  40.0         IT   80000
4      Eva  28.0         HR   52000

In [31]:
c =  pd.read_csv("Data.csv")
c

      Name  Age Department  Salary
0    Alice   25         HR   50000
1      Bob   30         IT   60000
2  Charlie   35    Finance   70000
3    David   40         IT   80000
4      Eva   28         HR   52000

In [32]:
# shows first 5 items of data
b.head()

      Name   Age Department  Salary
0    Alice  25.0         HR   50000
1      Bob  30.0         IT   60000
2  Charlie   NaN    Finance   70000
3    David  40.0         IT   80000
4      Eva  28.0         HR   52000

In [33]:
# shows last 5 items of data
b.tail()

      Name   Age Department  Salary
0    Alice  25.0         HR   50000
1      Bob  30.0         IT   60000
2  Charlie   NaN    Finance   70000
3    David  40.0         IT   80000
4      Eva  28.0         HR   52000

In [45]:
b.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        5 non-null      object
 1   Age         4 non-null      float64
 2   Department  5 non-null      object
 3   Salary      5 non-null      int64
dtypes: float64(1), int64(1), object(2)
memory usage: 288.0+ bytes

In [35]:
b.describe()

         Age        Salary
count   4.00      5.000000
mean   30.75  62400.000000
std     6.50  12601.587202
min    25.00  50000.000000
25%    27.25  52000.000000
50%    29.00  60000.000000
75%    32.50  70000.000000
max    40.00  80000.000000

In [47]:
b.columns

Index(['Name', 'Age', 'Department', 'Salary'], dtype='object')

In [48]:
b.dtypes

Name           object
Age           float64
Department     object
Salary          int64
dtype: object

In [49]:
b.shape

(5, 4)

In [50]:

b[["Name", "Age"]]

      Name   Age
0    Alice  25.0
1      Bob  30.0
2  Charlie   NaN
3    David  40.0
4      Eva  28.0

In [51]:
b.iloc[1:4]

      Name   Age Department  Salary
1      Bob  30.0         IT   60000
2  Charlie   NaN    Finance   70000
3    David  40.0         IT   80000

In [54]:
t.loc["ii"]

0    2
Name: ii, dtype: int64

b

In [56]:
b2 = b[ b["Age"]<30 ]
b2

    Name   Age Department  Salary
0  Alice  25.0         HR   50000
4    Eva  28.0         HR   52000

In [75]:
b.loc[1, "Age"]= 96.0
b

      Name   Age Department  Salary   color
0    Alice  25.0         HR   50000    red
1      Bob  96.0         IT   60000    blue
2  Charlie  96.0    Finance   70000   green
3    David  40.0         IT   80000  yellow
4      Eva  28.0         HR   52000    pink

In [63]:
b["color"]= ["red ", "blue", "green","yellow", "pink"]
b

      Name   Age Department  Salary   color
0    Alice  25.0         HR   50000    red
1      Bob  30.0         IT   60000    blue
2  Charlie  96.0    Finance   70000   green
3    David  40.0         IT   80000  yellow
4      Eva  28.0         HR   52000    pink

In [65]:
b.drop("color", axis=1)

      Name   Age Department  Salary
0    Alice  25.0         HR   50000
1      Bob  30.0         IT   60000
2  Charlie  96.0    Finance   70000
3    David  40.0         IT   80000
4      Eva  28.0         HR   52000

In [66]:
b.drop(1, axis=0)

      Name   Age Department  Salary   color
0    Alice  25.0         HR   50000    red
2  Charlie  96.0    Finance   70000   green
3    David  40.0         IT   80000  yellow
4      Eva  28.0         HR   52000    pink

In [72]:
b.isnull()

    Name    Age  Department  Salary  color
0  False  False       False   False  False
1  False  False       False   False  False
2  False  False       False   False  False
3  False  False       False   False  False
4  False  False       False   False  False

In [68]:
b.isnull().sum()

Name          0
Age           0
Department    0
Salary        0
color         0
dtype: int64

In [70]:
b.dropna()

      Name   Age Department  Salary   color
0    Alice  25.0         HR   50000    red
1      Bob  30.0         IT   60000    blue
2  Charlie  96.0    Finance   70000   green
3    David  40.0         IT   80000  yellow
4      Eva  28.0         HR   52000    pink

In [76]:
b = pd.read_excel("Data.xlsx")
b

      Name   Age Department  Salary
0    Alice  25.0         HR   50000
1      Bob  30.0         IT   60000
2  Charlie   NaN    Finance   70000
3    David  40.0         IT   80000
4      Eva  28.0         HR   52000

In [77]:
b["color"]= ["red ", "blue", "green","yellow", "pink"]
b

      Name   Age Department  Salary   color
0    Alice  25.0         HR   50000    red
1      Bob  30.0         IT   60000    blue
2  Charlie   NaN    Finance   70000   green
3    David  40.0         IT   80000  yellow
4      Eva  28.0         HR   52000    pink

In [78]:
b.isnull()

    Name    Age  Department  Salary  color
0  False  False       False   False  False
1  False  False       False   False  False
2  False   True       False   False  False
3  False  False       False   False  False
4  False  False       False   False  False

In [80]:
b.isnull().sum()

Name          0
Age           1
Department    0
Salary        0
color         0
dtype: int64

In [82]:
b.fillna(g["Age"].mean())

      Name   Age Department  Salary   color
0    Alice  25.0         HR   50000    red
1      Bob  30.0         IT   60000    blue
2  Charlie  43.8    Finance   70000   green
3    David  40.0         IT   80000  yellow
4      Eva  28.0         HR   52000    pink

In [83]:
b.sort_values("Age", ascending= True)

      Name   Age Department  Salary   color
0    Alice  25.0         HR   50000    red
4      Eva  28.0         HR   52000    pink
1      Bob  30.0         IT   60000    blue
3    David  40.0         IT   80000  yellow
2  Charlie   NaN    Finance   70000   green

In [86]:
b.Age

0    25.0
1    30.0
2     NaN
3    40.0
4    28.0
Name: Age, dtype: float64

In [90]:
b.to_csv("final.csv", index=False)
b

      Name   Age Department  Salary   color
0    Alice  25.0         HR   50000    red
1      Bob  30.0         IT   60000    blue
2  Charlie   NaN    Finance   70000   green
3    David  40.0         IT   80000  yellow
4      Eva  28.0         HR   52000    pink